

/**
 * 量词: 0-1
 * 
 */

let reg=/^[+-]?\d+(\.\d+)?$/;
reg.test(+123)
reg.test(-123)
reg.test(-123.123)


/**
 * 匹配不捕获:
 * 分组中最前面添加'?:' 捕获的时候不进行捕获
 */

let reg_beta1=/^[+-]?\d+(?:\.\d+)?$/;
reg_beta1.exec('123.345');

/**
 * 取消正则的贪婪性：
 * 在量词元字符的后面添加?
 */
let reg_beta2=/\d+?/;
'123456'.match(reg_beta2);

/**
 * 正向预查 (?=abc)
 * 负向预查 (?!abc)
 */

// 后面不能为5的数字
let reg_beta3=/\d{1}(?!5)/g;
'12345123451234512345123456'.match(reg_beta3);

// 后面必须为5的数字
let reg_beta3=/\d{1}(?=5)/g;
'12345123451234512345123456'.match(reg_beta3);

